{"about":"Om","built-with":"Bygget med:","city":"Oslo, Norge","code-site":"Kode","education":"Utdannelse","footer-text-p1":"Designet i Adobe XD. Bygget med Next.js og Tailwind CSS.","footer-text-p2":"Publisert med Netlify.","graduated":"juni 2024","greeting":"Hei! Takk for at du besøkte porteføljen min. \n\nJeg er en front-end-utvikler med et sterkt fundament innen HTML, CSS, JavaScript, TypeScript, React og Next.js. \n\nJeg har en variert utdanningsbakgrunn, inkludert en grad i kunst- og designutdanning og formell opplæring i front-end-utvikling. Denne blandingen av kreativitet og tekniske ferdigheter gjør meg i stand til å utvikle brukersentrerte applikasjoner med sterkt fokus på både funksjonalitet og estetikk. \n\nJeg er alltid ivrig etter å lære og vokse, enten ved å utforske backend-teknologier som SQL og NoSQL, forbedre ytelsesoptimalisering eller eksperimentere med nye rammeverk og verktøy. Målet mitt er å bygge skalerbare, vedlikeholdbare og effektive nettapplikasjoner som gir gode opplevelser for brukerne. \n\nPå fritiden liker jeg å utforske kreativ koding, UI/UX-design og prototyping, i tillegg til å tilbringe tid utendørs, hekle amigurumis, og jeg elsker å lage mat.\n","keywords":"Nøkkelord om meg","noroff":"Fagskoleutdanning i front-end utvikling ved Noroff","occupation":"Webutvikling","oslomet":"Bachelor i kunst, design og håndverkslærer ved OsloMet","other":"Annen","profession":"Webutvikler, UX-designer","project":{"artfulBids":{"description":"Dette prosjektet var å lage et auksjonsnettsted, der brukere kan legge til varer det skal bys på og by på varer andre brukere har lagt ut på auksjon. Backend er fra Noroff API."},"holidaze":{"description":"Min avsluttende eksamen var å lage en bookingside for overnatting, med både en kunde- og en admin-vendt side. Jeg valgte å lære meg Next.js og brukte App Router. Backend er fra Noroff API."},"omniThings":{"description":"I dette prosjektet brukte jeg React til å lage en eCom-butikk, hvor jeg ble litt kjent med Redux. Backend er fra Noroff API."},"popTheBubble":{"description":"Pop The Bubble er et nettleserbasert spill bygget med TypeScript, der spilleren må sprekke så mange bobler som mulig før tiden renner ut. Spillet har forskjellige vanskelighetsgrader, dynamiske animasjoner og enkel, men utfordrende mekanikk."}},"projects":"Prosjekter","projects-noroff":"Prosjekter hos Noroff","skills":"Ferdigheter","skills-set":"Nysgjerrig, kreativ, rask læring, øye for design, lagspiller, lidenskapelig, tilpasningsdyktig, brukerfokusert","uia":"Årsstudie i kommunikasjon ved UiA","website":"Nettsted","web-tech":"Web-teknologier","work":"Tilgjengelig for arbeid/prosjekter"}